# StructuralCustomConnectionComponentsRelationship Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralCustomConnectionFailures..::..StructuralCustomConnectionComponentsRelationship Property
BuiltInFailures..::..StructuralCustomConnectionFailures Class See Also
---
Cannot create custom connection due to relationships to external elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralCustomConnectionComponentsRelationship { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralCustomConnectionComponentsRelationship As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralCustomConnectionComponentsRelationship {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace